#
# This is a Shiny web application. You can run the application by clicking
# the 'Run App' button above.
#
# Find out more about building applications with Shiny here:
#
#    https://shiny.posit.co/
#

library(shiny)
library(shinyBS)
library(shinythemes)
library(openxlsx)
library(shinyauthr)
library(shinyjs)
library(RMySQL)
library(shinyWidgets)
library(shinysurveys)
library(shinyFeedback)
library(shinytitle)
library(pool)
library(DBI)
library(dplyr)
library(tidyr)
library(lubridate)
library(DT)


user_base <- data.frame(
  user = c("accord", "tops"),
  password = c("22222", "11111"), 
  permissions = c("admin", "standard"),
  name = c("User One", "User Two"),
  stringsAsFactors = FALSE,
  row.names = NULL
)


  #pool <- pool::dbPool(
  #drv = RMySQL::MySQL(),
  #dbname = "accordsurveys",
  #host = "127.0.0.1",
  #username = "root",
  #password = "WIN72007@NAZAr"
 #)

pool <- pool::dbPool(
  drv = RMySQL::MySQL(),
  dbname = "bmwxck7oqx3t52ko",
  host = "w1kr9ijlozl9l79i.chr7pe7iynqr.eu-west-1.rds.amazonaws.com",
  username = "iporeta4vucogn0v",
  password = "f31z0fec7vie1e04"
)

onStop(function() {
  print("POOL CLOSED!!!!!!!!!!!!!")
  poolClose(pool)
})






#Sys.setlocale("LC_CTYPE", "ukrainian")
#questions <- read.csv2(file = "questions.txt",header = TRUE, sep = ";")


questions <- data.frame(
  question = c( 
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)",11),
    rep("Департамент безпеки (Ткачук І.В.)",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)",11),
    rep("Департамент маркетингу (Кривоус І.А.)",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)",11),
    rep("Кредитний департамент (Голеня О.Є.)",11),
    rep("Операційний департамент (Баклаєва В.О.)",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)",11),
    rep("Юридичний департамент (Булгаков П.А.)",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.) ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.) ",11),
    rep("Департамент безпеки (Ткачук І.В.) ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.) ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.) ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.) ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.) ",11),
    rep("Департамент маркетингу (Кривоус І.А.) ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.) ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.) ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.) ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.) ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.) ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.) ",11),
    rep("Кредитний департамент (Голеня О.Є.) ",11),
    rep("Операційний департамент (Баклаєва В.О.) ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.) ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.) ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.) ",11),
    rep("Юридичний департамент (Булгаков П.А.) ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)  ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)  ",11),
    rep("Департамент безпеки (Ткачук І.В.)  ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)  ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)  ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)  ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)  ",11),
    rep("Департамент маркетингу (Кривоус І.А.)  ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)  ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)  ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)  ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)  ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)  ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)  ",11),
    rep("Кредитний департамент (Голеня О.Є.)  ",11),
    rep("Операційний департамент (Баклаєва В.О.)  ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)  ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)  ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)  ",11),
    rep("Юридичний департамент (Булгаков П.А.)  ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)   ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)   ",11),
    rep("Департамент безпеки (Ткачук І.В.)   ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)   ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)   ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)   ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)   ",11),
    rep("Департамент маркетингу (Кривоус І.А.)   ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)   ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)   ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)   ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)   ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)   ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)   ",11),
    rep("Кредитний департамент (Голеня О.Є.)   ",11),
    rep("Операційний департамент (Баклаєва В.О.)   ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)   ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)   ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)   ",11),
    rep("Юридичний департамент (Булгаков П.А.)   ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)    ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)    ",11),
    rep("Департамент безпеки (Ткачук І.В.)    ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)    ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)    ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)    ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)    ",11),
    rep("Департамент маркетингу (Кривоус І.А.)    ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)    ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)    ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)    ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)    ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)    ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)    ",11),
    rep("Кредитний департамент (Голеня О.Є.)    ",11),
    rep("Операційний департамент (Баклаєва В.О.)    ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)    ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)    ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)    ",11),
    rep("Юридичний департамент (Булгаков П.А.)    ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)     ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)     ",11),
    rep("Департамент безпеки (Ткачук І.В.)     ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)     ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)     ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)     ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)     ",11),
    rep("Департамент маркетингу (Кривоус І.А.)     ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)     ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)     ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)     ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)     ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)     ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)     ",11),
    rep("Кредитний департамент (Голеня О.Є.)     ",11),
    rep("Операційний департамент (Баклаєва В.О.)     ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)     ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)     ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)     ",11),
    rep("Юридичний департамент (Булгаков П.А.)     ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)      ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)      ",11),
    rep("Департамент безпеки (Ткачук І.В.)      ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)      ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)      ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)      ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)      ",11),
    rep("Департамент маркетингу (Кривоус І.А.)      ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)      ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)      ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)      ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)      ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)      ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)      ",11),
    rep("Кредитний департамент (Голеня О.Є.)      ",11),
    rep("Операційний департамент (Баклаєва В.О.)      ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)      ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)      ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)      ",11),
    rep("Юридичний департамент (Булгаков П.А.)      ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)       ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)       ",11),
    rep("Департамент безпеки (Ткачук І.В.)       ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)       ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)       ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)       ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)       ",11),
    rep("Департамент маркетингу (Кривоус І.А.)       ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)       ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)       ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)       ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)       ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)       ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)       ",11),
    rep("Кредитний департамент (Голеня О.Є.)       ",11),
    rep("Операційний департамент (Баклаєва В.О.)       ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)       ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)       ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)       ",11),
    rep("Юридичний департамент (Булгаков П.А.)       ",11),
    
    rep("Адміністративно-господарське управління (Ревуцький В.В.)        ",11),
    rep("Департамент банкнотного бізнесу (Комашко О.Л.)        ",11),
    rep("Департамент безпеки (Ткачук І.В.)        ",11),
    rep("Департамент валютного нагляду (Лосенко Р.П.)        ",11),
    rep("Департамент інформаційних технологій (Семенцул Є.В.)        ",11),
    rep("Департамент казначейських операцій (Єфремов Ю.В.)        ",11),
    rep("Департамент корпоративного бізнесу (Клевацький Д.С.)        ",11),
    rep("Департамент маркетингу (Кривоус І.А.)        ",11),
    rep("Департамент обліку та контролю банків. опер. (Лебедєва О.В.)        ",11),
    rep("Департамент ризик-менеджементу (Войтків М.В.)        ",11),
    rep("Департамент розвитку картк. бізнесу та спожив. кредит. (Кутас О.В.)        ",11),
    rep("Департамент розвитку неторгових операцій (Музика А.І.)        ",11),
    rep("Департамент розвитку регіональної мережі (Олійник І.А.)        ",11),
    rep("Департамент розвитку розрах. опер. та депозит. продук. (Мулюкова Л.О.)        ",11),
    rep("Кредитний департамент (Голеня О.Є.)        ",11),
    rep("Операційний департамент (Баклаєва В.О.)        ",11),
    rep("Управління по роботі з персоналом (Кирилішина Т.В.)        ",11),
    rep("Управління фінансового моніторингу (Черняк В.В.)        ",11),
    rep("Фінансово-економічний департамент (Балун Д.Л.)        ",11),
    rep("Юридичний департамент (Булгаков П.А.)        ",11),
    
    rep("1. Що, на вашу думку, потребує покращення у їх роботі? (максимум 1000 символів)",1),
    rep("2. Чи стикалися ви з проявами зверхності, грубості, ігнорування або емоційного тиску з боку керівника підрозділу? (максимум 1000 символів)",1)
  ),
  
  option = option <- c(
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "не було комунікації",	"1",	"2",	"3",	"4",	"5",	"6",	"7",	"8",	"9",	"10",
    "Заповніть поле",
    "Заповніть поле"),
  
  
  # For matrix questions, the IDs should be the same for each question
  # but different for each matrix input unit
  input_type = c(rep("matrix", 1980), rep("text", 2)),
  input_id = c(rep("q1", 220),rep("q2", 220),rep("q3", 220),rep("q4", 220),rep("q5", 220),rep("q6", 220),rep("q7", 220),rep("q8", 220),rep("q9", 220),rep("q10", 1),rep("q11", 1)),
  dependence = NA,
  dependence_value = NA,
  required = c(rep(FALSE, 1982))
  #page = c(rep(1, 214), rep(2, 54), rep(3, 54), rep(4, 54))
)




# Define UI for application that draws a histogram
ui <- fluidPage(
  
  shinyjs::useShinyjs(),
  
  
  div(class = "pull-right", logoutUI(id = "logout", label="Вийти", 
                                     icon = icon("angle-right",
                                                 class = "normal"))),
  
  # add login panel UI function
  
  
  div(id = "loginpage", loginUI(id = "login", title = tags$div(tags$img(src="Accord_logos.png", height = 50, width = 50),tags$br(tags$br("Вхід до системи"))), 
                                user_title = "Логін",
                                pass_title = "Пароль",
                                error_message = "Невірний логін або пароль!",
                                login_title = "Увійти", additional_ui =  tags$hr(tags$div(id = "myfooter",
                                                                                          tags$p(
                                                                                            "З питань роботи AccordBoosty пишіть ",
                                                                                            tags$a(
                                                                                              href = "mailto:mykhailechko@accordbank.com.ua?Subject=AccordSurvey",
                                                                                              target="_top", "адміністратору"
                                                                                            )
                                                                                          )
                                )
                                )
                                
                                
  )),
  
  tableOutput("user_table"),
  
  tags$head(
    # Note the wrapping of the string in HTML()
    tags$style(HTML("@import url('https://fonts.googleapis.com/css?family=Source+Code+Pro:200');

body  {
    background-image: url('https://w0.peakpx.com/wallpaper/738/166/HD-wallpaper-blue-digital-background-technology-digital-technology-coding-concepts-blue-technology-background.jpg');
  background-size:cover;
        -webkit-animation: slidein 100s;
        animation: slidein 100s;

        -webkit-animation-fill-mode: forwards;
        animation-fill-mode: forwards;

        -webkit-animation-iteration-count: infinite;
        animation-iteration-count: infinite;

        -webkit-animation-direction: alternate;
        animation-direction: alternate;              
}

@-webkit-keyframes slidein {
from {background-position: top; background-size:1300px; }
to {background-position: -100px 0px;background-size:2750px;}
}

@keyframes slidein {
from {background-position: top;background-size:1300px; }
to {background-position: -100px 0px;background-size:2750px;}

}



.center
{
  display: flex;
  align-items: center;
  justify-content: center;
  position: absolute;
  margin: auto;
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
  background: rgba(75, 75, 250, 0.3);
  border-radius: 3px;
}
.center h1{
  text-align:center;
  color:white;
  font-family: 'Source Code Pro', monospace;
  text-transform:uppercase;
}"))
  ),
  
  
  tags$head(
    # Note the wrapping of the string in HTML()
    tags$style(HTML("body {
  font-family: system-ui, sans-serif;
  padding: 1rem;
}


table {
  width: 100%;
  height: 70vh;
  margin: 0 auto;
  display: block;
  overflow-x: auto;
}

tbody {
  
  white-space: nowrap;
}

th,
td {
  padding: 1rem;
}

thead {
  position: sticky;
  top: 0;
  background: #4e5d6c;
  text-align: left;
}

#login-user_name{
background-color:white;color:black;border-color:white;
}

#login-password{
background-color:white;color:black;border-color:white;
}

#login-button{
width: 100%;
}

#login-button:hover{
background-color: #D22B2B;
}

h2 div{
font-size:20px;font-family: system-ui, sans-serif;
//vertical-align: middle;
}


.well {
    left      : 50%;
    top       : 50%;
    position  : absolute;
    transform : translate(-50%, -50%);
        width: 500px;
    height: 450px;
}

#myfooter{
font-size:10px;color:red;font-family: system-ui, sans-serif;
}

#testUI{
font-size:10px;font-family: system-ui, sans-serif;margin-top:10px;margin-right:15px;color:#df691a;font-weight: bolder;
}


.rt-tr-highlight-sticky:hover {
background-color:#4e5d6c;
}


"))
  ),
  
  
  
  
  
  tags$head(
    HTML(
      "
          <script>
          var socket_timeout_interval
          var n = 0
          $(document).on('shiny:connected', function(event) {
          socket_timeout_interval = setInterval(function(){
          Shiny.onInputChange('count', n++)
          }, 15000)
          });
          $(document).on('shiny:disconnected', function(event) {
          clearInterval(socket_timeout_interval)
          });
          </script>
          "
    )
  ),
  
  
  
  
  theme = shinytheme("superhero"), #flatly, journal, lumen, readable, simplex, superhero, united, yeti
  
  div( id = "display_content",
       
       fluidPage(

       # App title ----
       #titlePanel("Результати опитування відділень Банку"),
       titlePanel(tags$div(tags$img(src="Accord_logos.png", height = 50, width = 50),"Результати опитування відділень Банку")),
         
         # Main panel for displaying outputs ----
         mainPanel(
           
           
            h5(textOutput("text3", container = span)),
            br(),
            
            dataTableOutput("count_surveys"),
            br(),
            
            textOutput("text1", container = span),
            br(),
            dataTableOutput("total_stat1"),
            br(),
            textOutput("text2", container = span),
            br(),
            dataTableOutput("total_stat2"),
            br(),
            textOutput("text4", container = span),
            br(),
            dataTableOutput("total_stat3"),
            br(),
            textOutput("text5", container = span),
            br(),
            dataTableOutput("total_stat4"),
            br(),
            textOutput("text6", container = span),
            br(),
            dataTableOutput("total_stat5"),
            br(),
            textOutput("text7", container = span),
            br(),
            dataTableOutput("total_stat6"),
            br(),
            textOutput("text8", container = span),
            br(),
            dataTableOutput("total_stat7"),
            br(),
            textOutput("text9", container = span),
            br(),
            dataTableOutput("total_stat8"),
            br(),
            textOutput("text10", container = span),
            br(),
            dataTableOutput("total_stat9"),
            br()
            

            #dataTableOutput("count_last"),
            #br(),
            #textOutput("text1", container = span),

            #dataTableOutput("results1"),
            #br(),
            #textOutput("text2", container = span),
            #dataTableOutput("results2")
           
         )
         
       )
  ) %>% shinyjs::hidden(),
  
  div( id = "display_survey",
       
       use_shiny_title(),
       #shinysurveys::teaching_r_questions
       shinysurveys::surveyOutput(df = questions,
                                  survey_title = div(img(src="Accord_logos.png", height = 35, width = 35), "Опитування"),
                                  survey_description = paste0('ЩОДО КОМУНІКАЦІЇ З ПІДРОЗДІЛАМИ ГБ за минулий місяць'),theme = "#7B1818",),
       
       useShinyjs(),
       tags$head(
         HTML("
                     <meta name='viewport' content= 'width=device-width, initial-scale=1.0'>
                     <link rel='shortcut icon' sizes='16x16' href='Accord_logos.png'>
                 ")
       ),
       
       tags$head(
         tags$style(
           HTML("#shiny-notification-panel {
             top: 0;
  bottom: unset;
  left: 0;
  right: 0;
  margin-left: auto;
  margin-right: auto;
  width: 100%;
  max-width: 450px;
  opacity:1;
             }
             "
           )
         )
       ),
       
       
       
       
       
       tags$body(
         HTML(
           "
          <script>
              document.getElementById('submit').innerHTML = 'Відправити';
          </script>
          
          "
         )
       ),
       
       
       tags$body(
         HTML(
           "
          <script>
          
              var iDiv1111 = document.createElement('div');
              iDiv1111.id = 'q1xxx';
              document.getElementById('q1-question').appendChild(iDiv1111);
              document.getElementById('q1xxx').innerText = `1. Наскільки швидко працівники підрозділу ГБ реагують на запити відділення?`;
              document.getElementById('q1').before(iDiv1111);
              iDiv1111.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');      

              var iDiv2222 = document.createElement('div');
              iDiv2222.id = 'q2xxx';
              document.getElementById('q2-question').appendChild(iDiv2222);
              document.getElementById('q2xxx').innerText = `2. Чи завжди надається вичерпна, структурована інформація при відповіді на запити?`;
              document.getElementById('q2').before(iDiv2222);
              iDiv2222.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
      
              var iDiv3333 = document.createElement('div');
              iDiv3333.id = 'q3xxx';
              document.getElementById('q3-question').appendChild(iDiv3333);
              document.getElementById('q3xxx').innerText = `3. Чи достатньо компетентно вирішуються  операційні питання при зверненні працівників вашого відділення?`;
              document.getElementById('q3').before(iDiv3333);
              iDiv3333.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');

              var iDiv4444 = document.createElement('div');
              iDiv4444.id = 'q4xxx';
              document.getElementById('q4-question').appendChild(iDiv4444);
              document.getElementById('q4xxx').innerText = `4. Наскільки чітко відповідальні особи ГБ розуміють специфіку роботи відділень?`;
              document.getElementById('q4').before(iDiv4444);
              iDiv4444.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');

              var iDiv5555 = document.createElement('div');
              iDiv5555.id = 'q5xxx';
              document.getElementById('q5-question').appendChild(iDiv5555);
              document.getElementById('q5xxx').innerText = `5 Наскільки прозорі та зрозумілі вимоги працівників підрозділу ГБ  до дій відділень?`;
              document.getElementById('q5').before(iDiv5555);
              iDiv5555.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');

              var iDiv6666 = document.createElement('div');
              iDiv6666.id = 'q6xxx';
              document.getElementById('q6-question').appendChild(iDiv6666);
              document.getElementById('q6xxx').innerText = `6. Наскільки легкий контакт із відповідальними особами ГБ (доступність, відкритість)?`;
              document.getElementById('q6').before(iDiv6666);
              iDiv6666.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');

              var iDiv7777 = document.createElement('div');
              iDiv7777.id = 'q7xxx';
              document.getElementById('q7-question').appendChild(iDiv7777);
              document.getElementById('q7xxx').innerText = `7. Як ви оцінюєте  фактичну швидкість обробки запитів обіцяним термінам?`;
              document.getElementById('q7').before(iDiv7777);
              iDiv7777.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');

              var iDiv8888 = document.createElement('div');
              iDiv8888.id = 'q8xxx';
              document.getElementById('q8-question').appendChild(iDiv8888);
              document.getElementById('q8xxx').innerText = `8. Оцініть, наскільки легко зрозуміти зміст листів/відповідей/інструкцій які надходять від працівників підрозділу?`;
              document.getElementById('q8').before(iDiv8888);
              iDiv8888.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');

              var iDiv9999 = document.createElement('div');
              iDiv9999.id = 'q9xxx';
              document.getElementById('q9-question').appendChild(iDiv9999);
              document.getElementById('q9xxx').innerText = `9. Наскільки ввічливо спілкуються працівники підрозділу при комунікації з працівниками відділення (електронне листування/телефонний контакт)?`;
              document.getElementById('q9').before(iDiv9999);
              iDiv9999.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');


              
              var iDiv8 = document.createElement('div');
              iDiv8.id = 'title-description-8';
              iDiv8.className = 'title-description';
              var iDiv8_5 = document.createElement('h1');
              iDiv8_5.id = 'survey-title8';
              var iDiv8_6 = document.createElement('p');
              iDiv8_6.id = 'survey-description8';
              
              document.getElementById('q10-question').before(iDiv8)
              document.getElementById('title-description-8').appendChild(iDiv8_5)
              document.getElementById('title-description-8').appendChild(iDiv8_6)
              document.getElementById('survey-description8').innerHTML = 'Відкриті запитання:';

              var iDiv8_8_8 = document.createElement('div');
              iDiv8_8_8.id = 'div8';
              document.getElementById('survey-title8').appendChild(iDiv8_8_8);
              document.getElementById('div8').innerHTML = '<img width=\"35\" height=\"35\" src=\"Accord_logos.png\">             Опитування            ';

          </script>
          
          "
         )
       ),
       
       
       
       
       tags$body(tags$style("#submit {color: white;background-color: grey;} ")),
       tags$body(tags$style("#survey-title {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
       tags$body(tags$style("#survey-title1 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
       tags$body(tags$style("#survey-title2 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
       tags$body(tags$style("#survey-title3 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
       tags$body(tags$style("#survey-description1 {text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;} ")),
       tags$body(tags$style("#survey-description2 {text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;} ")),
       tags$body(tags$style("#survey-description3 {text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;} ")),
       tags$body(tags$style("table {font-size: 10px;} ")),
       tags$body(tags$style("#login-user_name {display: block;
       width: 100%;
       height: 39px;
       padding: 8px 16px;
       font-size: 15px;
       line-height: 1.42857143;
       color: #2b3e50;
         background-color: #ffffff;
         background-image: none;
       border: 1px solid transparent;
       border-radius: 0;
       -webkit-box-shadow: inset 0 1px 1px rgba(0,0,0,0.075);
       box-shadow: inset 0 1px 1px rgba(0,0,0,0.075);
       -webkit-transition: border-color ease-in-out .15s,-webkit-box-shadow ease-in-out .15s;
       -o-transition: border-color ease-in-out .15s,box-shadow ease-in-out .15s;
       transition: border-color ease-in-out .15s,box-shadow ease-in-out .15s} ")),
       tags$body(tags$style("#login-user_name:focus {border-color: #2c3e50;
         outline: 0;
       -webkit-box-shadow: inset 0 1px 1px rgba(0,0,0,0.075),0 0 8px rgba(44,62,80,0.6);
       box-shadow: inset 0 1px 1px rgba(0,0,0,0.075),0 0 8px rgba(44,62,80,0.6)} ")),
       
       
       tags$body(tags$style("h2 {orphans: 3;
widows: 3;
page-break-after: avoid;
font-family: inherit;
font-weight: 400;
line-height: 1.1;
color: inherit;
font-weight: normal;
line-height: 1;
color: #ebebeb;
margin-top: 21px;
margin-bottom: 10.5px;font-size: 20px;} ")),
       
       tags$body(tags$style("table {font-size: 10px;")),
       
       
       #font-size: 65%;
       #font-size: 32px;
       
       
       tags$body(tags$style("td {color: black;text-align: left !important;}")),
       tags$body(tags$style("th {color: darkred;text-align: left !important;}")),
       #tags$body(tags$style("#q11-question {width: 120%;word-break: break-word}")),
       tags$body(tags$style("table {text-align: left;word-break: break-word;  border-collapse: initial;widht:auto;height:auto}")),
       tags$body(tags$style(".radioMatrixInput table {-webkit-border-vertical-spacing: 0rem;-webkit-border-horizontal-spacing: 0rem;}")),
       tags$head(tags$style("input[type=radio] {accent-color: red;}")),
       tags$head(tags$style("#comment-label {color: red;}")),
       tags$head(tags$style(".modal-content {background-color:white;}")),
       tags$head(tags$style(".modal-title {background-color:white;}")),
       tags$head(tags$style(".modal-header {background-color:white;}")),
       tags$head(tags$style("div #myfooter p {color: white;}")),
       
       tags$body(tags$style("#DataTables_Table_0_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_0 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_0 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_1_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_1 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_1 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_2_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_2 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_2 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_3_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_3 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_3 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_4_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_4 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_4 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_5_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_5 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_5 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_6_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_6 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_6 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_7_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_7 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_7 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_8_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_8 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_8 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#DataTables_Table_9_wrapper {background-color:#4e5d6c;color: white;width: 130%}")),
       tags$body(tags$style("#DataTables_Table_9 td {background-color:#4e5d6c;color: white;font-family: arial;}")),
       tags$body(tags$style("#DataTables_Table_9 th {background-color:#4e5d6c;color: white;font-family: arial}")),
       tags$body(tags$style("#text1 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text2 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text4 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text4 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text5 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text6 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text7 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text8 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text9 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text10 {color:white;font-family: arial;font-size:10px;width: 70%}")),
       tags$body(tags$style("#text3 {color:white;font-family: arial;width: 70%}")),
       
       # для зменншення відступу між рядками таблиці матриці оцінок
       tags$body(tags$style("td {padding-top: 0 !important; padding-bottom: 0 !important;}")),
       
       tags$body(tags$style("#login-button {background-color:#C41E3A;}")),
       tags$body(tags$style("#survey-title {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
       tags$body(tags$style("#survey-description {text-align: center;margin: 2px;font-size: 1.6rem;font-weight: bold;} ")),
       tags$body(tags$style("#survey-title8 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
       tags$body(tags$style("#survey-description8 {text-align: center;margin: 2px;font-size: 1.6rem;font-weight: bold;} ")),
       tags$head(tags$style(".question-input .control-label {text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B;}")),
       #tags$body(tags$style("p #survey-description {font-size: 15px;}")),
       
       
  ) %>% shinyjs::hidden(),
  
  
  shinyjs::useShinyjs(),
  
  
  
)

# Define server logic required to draw a histogram
server <- function(input, output, session) {
  
  shinyjs::show(id = "loginpage")
  
  logout_init <- shinyauthr::logoutServer(
    id = "logout",
    active = reactive(credentials()$user_auth)
  )
  
  credentials <- shinyauthr::loginServer(
    id = "login",
    data = user_base,
    user_col = user,
    pwd_col = password,
    #sodium_hashed = TRUE,
    log_out = reactive(logout_init())
  )
  
  
  user_data <- reactive({credentials()$info})
  
  shiny::observe({
    req(credentials()$user_auth)
    if (user_data()$user == "tops"){
      shinyjs::show(id = "display_content")
    }
  })
  
  shiny::observe({
    req(credentials()$user_auth)
    if (user_data()$user == "accord"){
      shinyjs::show(id = "display_survey")
    }
  })
  
  shiny::observe({
    req(!credentials()$user_auth)
    shinyjs::hide(id = "display_content")
  })
  
  shiny::observe({
    req(!credentials()$user_auth)
    shinyjs::hide(id = "display_survey")
  })
  
  
  shinysurveys::renderSurvey()
  change_window_title(session, "Опитування")
  flashing_window_title( session, "Акордбанк", inactive_only = TRUE, interval = 1000 )
  
  observeEvent(input$submit, {
    

 


    
    if (is.null(input$q1) || is.null(input$q2) || is.null(input$q3) || is.null(input$q4) || is.null(input$q5) || is.null(input$q6) || is.null(input$q7) || is.null(input$q8) || is.null(input$q9)) {
      print("Не всі поля заповнені!!!!!!")
      showModal(modalDialog(footer = NULL,easyClose = T,
                            title = "Ви не проставили всі оцінки! Будь ласка перевірте всі питання!"))
    }else{
      showModal(modalDialog(footer = NULL,
                            title = "Ваші відповіді надіслано! Дякуємо за участь в опитуванні!",
                            #"You can customize what actions happen when a user finishes a survey using input$submit."
      ))
      
      #substr(q12$question_id, 1, nchar(q12$question_id)-1)
      
      #print(getSurveyData())
      
      #print(input$q10)

      question_id <- c("1. Що, на вашу думку, потребує покращення у їх роботі?", "2. Чи стикалися ви з проявами зверхності, грубості, ігнорування або емоційного тиску з боку керівника підрозділу?")
      question_type <- c("text", "text")
      response <- c(input$q10, input$q11)
      q <- c("q10", "q11")
      # Creating a dataframe
      df <- data.frame(question_id = question_id, question_type = question_type, response = response, q = q)
      # Displaying the dataframe

      q1 <- as.data.frame(input$q1)
      q1$q <- c(rep("q1",20))
      
      q2 <- as.data.frame(input$q2)
      q2$question_id <- substr(q2$question_id, 1, nchar(q2$question_id)-1)
      q2$q <- c(rep("q2",20))
      
      q3 <- as.data.frame(input$q3)
      q3$question_id <- substr(q3$question_id, 1, nchar(q3$question_id)-2)
      q3$q <- c(rep("q3",20))
      
      
      q4 <- as.data.frame(input$q4)
      q4$question_id <-  substr(q4$question_id, 1, nchar(q4$question_id)-3)
      q4$q <- c(rep("q4",20))
      
      q5 <- as.data.frame(input$q5)
      q5$question_id <-  substr(q5$question_id, 1, nchar(q5$question_id)-4)
      q5$q <- c(rep("q5",20))
      
      q6 <- as.data.frame(input$q6)
      q6$question_id <-  substr(q6$question_id, 1, nchar(q6$question_id)-5)
      q6$q <- c(rep("q6",20))
      
      q7 <- as.data.frame(input$q7)
      q7$question_id <- substr(q7$question_id, 1, nchar(q7$question_id)-6)
      q7$q <- c(rep("q7",20))
      
      q8 <- as.data.frame(input$q8)
      q8$question_id <- substr(q8$question_id, 1, nchar(q8$question_id)-7)
      q8$q <- c(rep("q8",20))
      
      q9 <- as.data.frame(input$q9)
      q9$question_id <- substr(q9$question_id, 1, nchar(q9$question_id)-8)
      q9$q <- c(rep("q9",20))
      


      final_data <- bind_rows(q1, q2, q3, q4, q5, q6, q7, q8, q9, df)
      final_data$date <- Sys.Date()
      
      final_data <- subset(final_data, select = -question_type)
      
      #print(final_data)
      
      ssql <- "INSERT INTO results (question_id, response, q, date) "

      for(i in 1:nrow(final_data)) {
        data <- DBI::dbGetQuery(pool,  paste0(ssql,"VALUES('", final_data$question_id[i],"','", substr(trimws(final_data$response[i]),1,1000),"','", final_data$q[i], "','", final_data$date[i],"')"))
      }
      
      
      ip <- session$request$HTTP_X_FORWARDED_FOR
      if (is.null(ip)) ip <- session$request$REMOTE_ADDR  # резервний варіант
      
      
      query <- paste0("INSERT INTO ip_log (ip_address, timestamp) VALUES ('", ip,"','", Sys.time(),")")
      print(query)
      #DBI::dbExecute(pool, query)
      
      #DBI::dbDisconnect(con)
      
      
      #print(paste0(ssql,"VALUES('", final_data$question_id,"','", final_data$response,"','", final_data$q, "','", final_data$date,"')"))
    }
    
    #if(any(c(1,2,3) %in% unlist(as.data.frame(input$q11[,3]))) == TRUE && input$comment == ""){
    #  showModal(modalDialog(footer = NULL,easyClose = T,
     #                       title = "Ви проставили оцінку від 1-3 балів! Будь ласка залиште свій коментар!"))
    #}
    

    #if(any(c(1,2,3) %in% unlist(as.data.frame(input$q12[,3]))) == TRUE && input$comment == ""){
    #  showModal(modalDialog(footer = NULL,easyClose = T,
    #                        title = "Ви проставили оцінку від 1-3 балів! Будь ласка залиште свій коментар!"))
    #}
    
    print("clicked save!!!")
    
    
    

    #ssql <- "INSERT INTO questionare (division, PIB, q11ker, q12ker, q13ker, q21ker, q22ker, q23ker, q31ker, q32ker, q33ker, q41ker, q42ker, q43ker) "
    
    
    #data <- DBI::dbGetQuery(pool,  paste0(ssql,"VALUES('", input$division,"','", input$PIB,"','", input$q11[1,3],
    #                                      "','", input$q12[1,3],
    #                                      "','", input$q13[1,3],
    #                                      "','", input$q21[1,3],
    #                                      "','", input$q22[1,3],
    #                                      "','", input$q23[1,3],
    #                                      "','", input$q31[1,3],
    #                                      "','", input$q32[1,3],
    #                                      "','", input$q33[1,3],
    #                                      "','", input$q41[1,3],
    #                                      "','", input$q42[1,3],
    #                                      "','", input$q43[1,3],"')"))
    #showNotification("Ваші відповіді надіслано! Дякуємо за участь в опитуванні!",duration = 4,closeButton = FALSE, type = "error",id = "info")

    
    
  })
  
  
  shiny::observe({
    req(credentials()$user_auth)
    if (user_data()$user == "tops"){
      
      output$text1 <- renderText({
        "1. Наскільки швидко працівники підрозділу ГБ реагують на запити відділення?"
      })
      
      output$text2 <- renderText({
        "2. Чи завжди надається вичерпна, структурована інформація при відповіді на запити?"
      })
      
      output$text4 <- renderText({
        "3. Чи достатньо компетентно вирішуються  операційні питання при зверненні працівників вашого відділення?"
      })
      
      
      output$text5 <- renderText({
        "4. Наскільки чітко відповідальні особи ГБ розуміють специфіку роботи відділень?"
      })
      
      output$text6 <- renderText({
        "5. Наскільки прозорі та зрозумілі вимоги працівників підрозділу ГБ  до дій відділень?"
      })
      
      output$text7 <- renderText({
        "6. Наскільки легкий контакт із відповідальними особами ГБ (доступність, відкритість)?"
      })
      
      output$text8 <- renderText({
        "7. Як ви оцінюєте  фактичну швидкість обробки запитів обіцяним термінам?"
      })
      
      output$text9 <- renderText({
        "8. Оцініть, наскільки легко зрозуміти зміст листів/відповідей/інструкцій які надходять від працівників підрозділу?"
      })
      
      output$text10 <- renderText({
        "9. Наскільки ввічливо спілкуються працівники підрозділу при комунікації з працівниками відділення (електронне листування/телефонний контакт)?"
      })
      
      
      output$text3 <- renderText({
        
        as.character(dbGetQuery(pool, paste0("SELECT replace(concat('Оцінка підрозділів ГБ зі сторони мережі відділень на ', max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')),' (', round(count(*)/182,0), ' анкети)'),'-','.') FROM results")))
        
      })
      
      
     
      
      
      data3 <- reactive({
        
        
        data3 = dbGetQuery(pool, paste0("SELECT 'Кількість отриманих анкет' as count_surveys, DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') as dates from results"))
        
        
        #data3 <- data3 %>% mutate(date = paste(quarters(floor_date(as.Date(date), "quarter")-1),format(floor_date(as.Date(date), "quarter")-1,"%Y"))) %>% group_by(count_surveys, date) %>%
        data3 <- data3 %>% group_by(count_surveys, dates) %>%
          summarise(count = n()/182) %>%
          spread(dates, count)
        data3 <- data3 %>% rename(" " = "count_surveys")
      
        return(data3)
      })
      

      data5 <- reactive({
        
        
        data5 = dbGetQuery(pool, paste0("
                                        
                                        Select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q1' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
Order by 2
) AS Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q1' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'
                                        
                                        "))
        
        return(data5)
      })
        
        data6 <- reactive({
          
          
          data6 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q2' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q2' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
        
        

        return(data6)
      })
        
        
        data7 <- reactive({
          
          
          data7 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q3' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q3' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data7)
        })     
        
        
        data8 <- reactive({
          
          
          data8 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q4' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q4' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data8)
        })  
        
        
        
        data9 <- reactive({
          
          
          data9 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q5' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q5' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data9)
        })                
        
      
        data10 <- reactive({
          
          
          data10 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q6' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q6' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data10)
        })
        
        
        data11 <- reactive({
          
          
          data11 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q7' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q7' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data11)
        })
        
        data12 <- reactive({
          
          
          data12 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q8' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q8' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data12)
        })
        
        data13 <- reactive({
          
          
          data13 = dbGetQuery(pool, paste0("select * from (SELECT replace(replace(question_id, SUBSTRING_INDEX(question_id,'_', -2), concat('(', SUBSTRING_INDEX(question_id,'_', -2), ')')),'_',' ') as 'Оцінка підрозділу головного офісу', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as 'середній бал',
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q9' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY question_id
order by 2
) as Q

union all

SELECT 'К-ть оцінок в цілому' as 'К-ть оцінок в цілому', round(sum(case when response = 'не було комунікації' then 0 else response end) / count(case when response <> 'не було комунікації' then  response end),1) as total_avg_rank,
concat(round((count(case when response in(1,2,3,4,5) then response end) / count(case when response <> 'не було комунікації' then  response end))*100,0),'%') as 'Частка оцінок нижче 5 балів включно',
count(case when response <> 'не було комунікації' then  response end) as 'К-ть зарахованих оцінок',
concat(round((count(case when response <> 'не було комунікації' then  response end) / count(response))*100,0),'%') as 'Частка зарахованих  оцінок від всіх голосувань',
  count((CASE response WHEN 1 THEN response ELSE NULL END)) AS '1',
  count((CASE response WHEN 2 THEN response ELSE NULL END)) AS '2',
  count((CASE response WHEN 3 THEN response ELSE NULL END)) AS '3',
  count((CASE response WHEN 4 THEN response ELSE NULL END)) AS '4',
  count((CASE response WHEN 5 THEN response ELSE NULL END)) AS '5',
  count((CASE response WHEN 6 THEN response ELSE NULL END)) AS '6',
  count((CASE response WHEN 7 THEN response ELSE NULL END)) AS '7',
  count((CASE response WHEN 8 THEN response ELSE NULL END)) AS '8',
  count((CASE response WHEN 9 THEN response ELSE NULL END)) AS '9',
  count((CASE response WHEN 10 THEN response ELSE NULL END)) AS '10',
  count((CASE response WHEN 'не було комунікації' THEN response ELSE NULL END)) AS 'не було комунікації'
FROM results 
where q = 'q9' and DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y') in (SELECT max(DATE_FORMAT(date + INTERVAL 1 MONTH, '01-%m-%Y')) FROM results)
GROUP BY 'К-ть оцінок в цілому'

"))
          
          
          
          return(data13)
        })
        
      output$total_stat1 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data5()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )
      
      output$total_stat2 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data6()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )
      
      
      output$total_stat3 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data7()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )
      
      output$total_stat4 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data8()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )
      
      output$total_stat5 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data9()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )
      
      output$total_stat6 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data10()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )  
   
      output$total_stat7 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data11()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )  
      
      output$total_stat8 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data12()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )  
      
      output$total_stat9 <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data13()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '50px', targets =c(1,2,3,4,15)))) 
          ),
          
        )}
      )  
      
      output$count_surveys <- renderDataTable({
        #selectize-input items full has-options has-items
        datatable(
          isolate(data3()),
          rownames = FALSE,
          options = list(
            #lengthMenu = list(c(10, 25, 50, 100), c("10","25","50", "100")),
            #buttons = c('copy', 'csv', 'excel', 'pdf', 'print', 'colvis'),
            #buttons = c('excel'),
            pageLength = -1,
            paging = FALSE,
            searching = FALSE,
            info = FALSE,
            sort = TRUE,
            highlight = TRUE,
            borderless = FALSE,
            striped = FALSE,
            compact = TRUE,
            wrap = FALSE,
            resizable = FALSE,
            columnDefs = (list(list(width = '100px', targets =c(0)))) 
          ),
          
        )}
      )
      
      
    }
    else{
      #hideTab(inputId = "mytabs" ,target = "Secret")
      #print(mtcars)
    }
    
  })
  
  
}

# Run the application 
shinyApp(ui = ui, server = server)
